IdeaRS.Connections
EndPlateData Class
Compatible with IDEA StatiCa 0.0
[Missing <summary> documentation for "T:IdeaRS.Connections.Data.EndPlateData"]
Inheritance Hierarchy
Object
 IdeaRS.Connections.Data.ConnectionCmdData
 IdeaRS.Connections.Data.ConnectionPartDataBase
 IdeaRS.Connections.Data.PlateDataBase
 IdeaRS.Connections.Data.EndPlateDataBase
 IdeaRS.Connections.Data.EndPlateData
 IdeaRS.Connections.Data.EndPlateOnFlangesData
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class EndPlateData : EndPlateDataBase,
	IBoltableData
The EndPlateData type exposes the following members.
Constructors
Name | Description
EndPlateData
 Constructor
Top
Properties
Name | Description
Anchoring
 Gets or sets the properties of the anchoring
BackingPlateOffset
BackingPlateOffsetBottom
BackingPlateOffsetTop
BackingPlateThickness
ConnectionType
 Gets or sets the type of connection of two parts.
 (Inherited from EndPlateDataBase.)
CreateNotch
 If true notch is generated automatically
Fastening
 Gets or sets the properties of the anchoring
InnerRadius
 Gets or sets the inner radius of the circular plate boundary.
 (Inherited from EndPlateDataBase.)
IsActive |  (Inherited from ConnectionCmdData.)
IsBackingPlate
IsWeld
 If true welds are generated automatically
Member1
 Gets or sets the first connected member
Member2
 Gets or sets the second connected member
MemberFlangesWeld
 Gets or sets the properties of the weld: flanges of connected member - end plate
MemberWeld
 Gets or sets the properties of the weld: web of connected member - end plate
Name
 Gets or set the name
 (Inherited from ConnectionCmdData.)
NotchOffset
 Gets or sets the value for notch offset
OffsetBottom
 Gets or sets the bottom offset of the end plate boundary in the horizontal direction (the width of the plate). The size of the end plate is based on the circumscribed box of the column.
 (Inherited from EndPlateDataBase.)
OffsetLeft
 Gets or sets the left offset of the end plate boundary in the vertical direction (the height of the plate). The size of the end plate is based on the circumscribed box of the column.
 (Inherited from EndPlateDataBase.)
OffsetRight
 Gets or sets the right offset of the end plate boundary in the vertical direction (the height of the plate). The size of the end plate is based on the circumscribed box of the column.
 (Inherited from EndPlateDataBase.)
OffsetTop
 Gets or sets the top offset of the end plate boundary in the horizontal direction (the width of the plate). The size of the end plate is based on the circumscribed box of the column.
 (Inherited from EndPlateDataBase.)
OperationId
 Gets or sets the identifier of the operation in the manufacturer sequence
 (Inherited from ConnectionCmdData.)
OuterRadius
 Gets or sets the outer radius of the circular plate boundary.
 (Inherited from EndPlateDataBase.)
PlateMaterialName
 Gets or sets the name of the material If value is null or empty material is taken from column
 (Inherited from PlateDataBase.)
PlateSizeMethod
 Gets or sets the method of the definition of dimensions of the plate
 (Inherited from EndPlateDataBase.)
PlateWeld
 Gets or sets the properties of the weld: end plate - flanges of connected to member
RelatedMember
 Gets or sets the related member (other members are connected to this member)
RelatedPlate
 Gets or sets the related plate (other member are connected to this plate)
RemainingPart1
 Gets or sets the information, whether end plate is at the begin or at the end of added member.
ShapeData
 Collection of plate editor data
 (Inherited from PlateDataBase.)
Thickness
 Gets or sets the thickness of the plate
 (Inherited from PlateDataBase.)
Top
Methods
Name | Description
Equals
Determines whether the specified object is equal to the current object.
 (Inherited from Object.)
Finalize
Allows an object to try to free resources and perform other cleanup operations before it is reclaimed by garbage collection.
 (Inherited from Object.)
GetHashCode
Serves as the default hash function.
 (Inherited from Object.)
GetShallowCopy |  (Inherited from ConnectionCmdData.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
MemberwiseClone
Creates a shallow copy of the current Object.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Top
See Also
Reference
IdeaRS.Connections.Data Namespace